src/Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнтервалДляОпросаРегламентныхЗаданийВФайловомВарианте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМеханизмАвтоматическогоОбменаДанными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляВыполненияРегламентныхЗаданийВФайловомВарианте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГруппыОграниченияПродажи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверIp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапускаТТ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоМяснов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/МестаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МестаРеализации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОтдела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКаталогТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаталогиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Comment>для обновления расписаний в РМ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Comment>для отображения в мобильном приложении</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>для отображения в мобильном приложении</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КухняКоды</Name>
					<Comment>для синхронизации с мобильным приложением</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КухняРасшифровка</Name>
					<Comment>для отображения в мобильном приложении</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрактиръМобайлНазвание</Name>
					<Comment>для отображения в мобильном приложении</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрактиръМобайлКод</Name>
					<Comment>для синхронизации с мобильным приложением</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FoursquareVENUE_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Instagram_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КаталогиТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Каталог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КаталогиТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Станция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Станции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦенРасписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДня</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыДней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фирма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Префикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КороткиеМеню</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КороткоеМеню</Name>
							<Comment>для новых РМ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/РабочиеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>РабочиеМеста</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрофильВхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыРМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Станция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерККМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборПейджеров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыПейджеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИнформационныеБазы/Forms/ФормаЭлемента/module.bsl
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если ЭтоНовый() И Не УправлениеРИБ.ВедениеСправочников() Тогда
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура тУзелНажатие(Элемент)
	УзелПланаОбмена.ПолучитьФорму().Открыть();
КонецПроцедуры

Процедура ПослеЗаписи()
	тпУзлы.Отбор.ИнформационнаяБаза.Установить(ПолучитьСсылку());
КонецПроцедуры

Процедура ОбработкаАктивизацииОбъекта(АктивныйОбъект, Источник)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриИзмененииДанных()
	ДеревоРМ = ДеревоРМ();
	тпУзлы.Отбор.ИнформационнаяБаза.Установить(ПолучитьСсылку());
КонецПроцедуры

Процедура ПриПовторномОткрытии(СтандартнаяОбработка)
	ДеревоРМ = ДеревоРМ();
КонецПроцедуры

Процедура ОбновлениеОтображения()
	ДеревоРМ = ДеревоРМ();
	
КонецПроцедуры

Процедура СерверIpПриИзменении(Элемент)
	ДобавитьСвойства();
	ЭлементыФормы.ДополнительныеСвойства.ОбновитьСтроки();
КонецПроцедуры

Процедура СоздатьНачальныйОбраз(СтрокаСоединения)
	Попытка
		ПланыОбмена.СоздатьНачальныйОбраз(ПолучитьУзелРИБ().ПолучитьОбъект(), СтрокаСоединения);
		Предупреждение("Создание начального образа завершено!");
		ЭтотОбъект.Прочитать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура МенюМестаРеализацииДобавитьРМмяснов(Кнопка)
	МР = Справочники.МестаРеализации.Мяснов;
	МастерСозданияРМ(МР, "myasnov-pos");
КонецПроцедуры

Процедура МастерСозданияРМ(МестоРеализации, ИмяПользователя)
	стрИмяХоста = "";
	Если Не ВвестиСтроку(стрИмяХоста,"Введите имя компьютера РМ") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(стрИмяХоста) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРМ = Наименование + " | " + стрИмяХоста;
	РМ = Справочники.РабочиеМеста.НайтиПоНаименованию(ИмяРМ);
	Если РМ.Пустая() Тогда
		СоздатьРМ(ИмяРМ,стрИмяХоста,ИмяПользователя,МестоРеализации,"","");	
	Иначе
		Предупреждение("РМ " + ИмяРМ + " уже есть в справочнике!");
	КонецЕсли;
КонецПроцедуры

Процедура МенюМестаРеализацииДобавитьРМОтдохни(Кнопка)
	МР = Справочники.МестаРеализации.НайтиПоНаименованию("Отдохни");
	МастерСозданияРМ(МР, "otdohni-pos");
КонецПроцедуры

Процедура КоманднаяПанель3Свернуть(Кнопка)
	ТС = ЭлементыФормы.ДеревоРМ.ТекущаяСтрока;
	Если ТС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТС.Строки.Количество() Тогда
		
		Если ТС.Родитель <> Неопределено Тогда
			ЭлементыФормы.ДеревоРМ.Свернуть(ТС.Родитель);
		КонецЕсли;
	Иначе
		ЭлементыФормы.ДеревоРМ.Свернуть(ТС);	
	КонецЕсли;
	
	Если ТС.Родитель <> Неопределено Тогда
		Для Каждого Т Из ТС.Родитель.Строки Цикл
			ЭлементыФормы.ДеревоРМ.Свернуть(Т);	
		КонецЦикла;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура КоманднаяПанель3Развернуть(Кнопка)
	ТС = ЭлементыФормы.ДеревоРМ.ТекущаяСтрока;
	Если ТС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыФормы.ДеревоРМ.Развернуть(ТС, Истина);
КонецПроцедуры

Процедура МенюКнопкиСоздатьНачОбразНаСервере(Кнопка)
	СтрокаСоединения = СтрокаСоединения();
	//ВвестиСтроку(СтрокаСоединения, "Строка соединения с ИБ на сервере приложений");
	СоздатьНачальныйОбраз(СтрокаСоединения);	
КонецПроцедуры

Процедура МенюКнопкиСоздатьНачОбразВфайл(Кнопка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Заголовок = "Выберите папку для размещения информационной базы:";
		
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Каталог = ДиалогВыбораФайла.Каталог;
	Иначе
		Возврат;
	КонецЕсли;
	
	СоздатьНачальныйОбраз("File = """ + Каталог + """");
	
КонецПроцедуры

Процедура ДействияФормыЗаполнитьПоДаннымСУПцентра(Кнопка)
	
	ДанныеДляЗаполнения = ОткрытьФормуМодально("Справочник.ИнформационныеБазы.Форма.ВводРегионаИНомераТТ", Новый Структура("Регион, НомерТТ", Регион, Прав(Код, 3)), ЭтаФорма);
	Если ДанныеДляЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляЗаполнения.Регион) Тогда
		Регион = ДанныеДляЗаполнения.Регион;
	КонецЕсли;
	
	ЗаполнитьПоНомеруТТ(ДанныеДляЗаполнения.НомерТТ, ДанныеДляЗаполнения.СтандартныеПорты);

	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

КонецПроцедуры

Процедура ПриЗакрытии()
	Если ЭтоНовый() Тогда
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		Ссылки = НайтиПоСсылкам(Массив(ПолучитьСсылку()));
		УдалитьОбъекты(Ссылки.ВыгрузитьКолонку(1));
	КонецЕсли;
КонецПроцедуры

Процедура РабочиеМестаПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ККМ = ПараметрыРМ(ДанныеСтроки.Ссылка).ККМ;
	Если ЗначениеЗаполнено(ККМ) Тогда
		ККМкодСУП = ККМ.КодСУП;
		ККМзаводской = ККМ.ЗаводскойНомер;
		ОформлениеСтроки.Ячейки.ККМ.УстановитьТекст(""+ККМкодСУП + ?(ЗначениеЗаполнено(ККМзаводской), "/" + ККМзаводской, ""));
	КонецЕсли;
КонецПроцедуры

Процедура ДеревоРМВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	ТО = ВыбраннаяСтрока.Значение;
	Если ТипЗнч(ТО) = Тип("СправочникСсылка.ТорговоеОборудование") Тогда 
		ТО.ПолучитьФорму().Открыть();
	ИначеЕсли ВыбраннаяСтрока.Строки.Количество() = 1 Тогда 
		ТО = ВыбраннаяСтрока.Строки[0].Значение;
		ТО.ПолучитьФорму().Открыть();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ГруппыИБПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

Процедура ПриОткрытии()
	ЭлементыФормы.ГруппыИБ.Значение.Отбор.ИнформационнаяБаза.Установить(ПолучитьСсылку());
	ЭлементыФормы.ГруппыИБ.НастройкаОтбора.ИнформационнаяБаза.Доступность = Ложь;
КонецПроцедуры

Если ЭтоНовый() И УправлениеРИБ.ВедениеСправочников() Тогда
	ДействияФормыЗаполнитьПоДаннымСУПцентра("");
КонецЕсли;


Массив = Массив("52","77","50");
ЭлементыФормы.КодГруппыОграниченияПродажи.СписокВыбора.ЗагрузитьЗначения(Массив);


ТекСсылка = ПолучитьСсылку();

ЭлементыФормы.РабочиеМеста.ИерархическийПросмотр = Ложь;
Если ЗначениеЗаполнено(Наименование) И Не ЭтоНовый() Тогда
	ЭлементыФормы.РабочиеМеста.ТекущийРодитель = ГруппаРМ();	
КонецЕсли;
РабочиеМеста.Отбор.ЭтоГруппа.Установить(Ложь);	
РабочиеМеста.Отбор.ИнформационнаяБаза.Установить(ТекСсылка);
НастройкиОбмена.Отбор.УзелИнформационнойБазы.Установить(ПолучитьУзелРИБ());
Фирмы.Отбор.ИнформационнаяБаза.Установить(ТекСсылка);	
ДополнительныеСвойства.Отбор.ИнформационнаяБаза.Установить(ТекСсылка);	
ГруппыИБ.Отбор.ИнформационнаяБаза.Установить(ТекСсылка);




УзелПланаОбмена = ПолучитьУзелРИБ(); 

тпУзлы.Отбор.ИнформационнаяБаза.Установить(ПолучитьСсылку());
ДобавитьСвойства();
ЭлементыФормы.ДополнительныеСвойства.ОбновитьСтроки();
